Tekla.Structures.Model.SelfIntersectingSurfaceException
This class represent an exception thrown when the an operation on a lofted plate has been determined to cause
a self intersecting surface

Tekla.Structures.Model.SelfIntersectingSurfaceException.#ctor
Constructs an instance of the class